{
  "homeName": "I'm Marco",
  "homeFrom": "based in Hessen, Deutschland.",
  "homeAbout1": "A passionate nerd who creates user-centric",
  "homeAbout2": "and accessible digital experiences.",
  "homeAbout3": "I also love React. And dogs.",
  "homeButtonText": "Take a look at my work",
  "navProjects": "Projects",
  "navAbout": "About",
  "navContact": "Contact",
  "projectsHeading": "Projects",
  "projectsSubheading": "(newest to oldest)",
  "viewSource": "View Source",
  "viewLiveVersion": "View Live Version",
  "password": "Password",
  "technologiesUsed": "Technologies Used",
  "more": "More",
  "less": "Less",
  "aboutProject": "About",
  "personalPortfolioPage": "Personal Portfolio Page",
  "aboutPersonalPortfolioPage1": "While there are no fancy technical things to implement (like User Authentication, API calls or Database implementation), I made sure to make it as visually appealing as I could - although I am not a design-savvy person at all. After a certain amount of research, I stumbled upon React-Spring, which is amazing albeit rather complicated - so you'll find various animations throughout the page like springs, trails and transitions.",
  "aboutPersonalPortfolioPage2": "Ever since my last project ('Make Me Awesome'), TailwindCSS has kind of grown on me so I used it again. What I like about Tailwind is that it doesn't come with pre-opinionated components like Bootstrap so there's more room for creative freedom.",
  "aboutPersonalPortfolioPage3": "The entire page is open-sourced on Github and free for everyone to use. If there are any suggestions, just open a Pull Request or contact me via my Contact Form.",
  "personalPortfolioFeature1": "React Hooks",
  "personalPortfolioFeature2": "Smooth Animations with React-Spring",
  "personalPortfolioFeature3": "Serverless Contact Form via Formspree",
  "personalPortfolioFeature4": "tsParticles Hero Component",
  "personalPortfolioFeature5": "Multilanguage Support",
  "mmaSubheading": "A personal activity and productivity tracker.",
  "aboutMma1": "A while ago, a friend of mine asked me if I could build a 'personal improvement' Webapp for him where he could track his activities and see where he spends his time on (productive tasks vs. unproductive tasks) so he could improve himself and his time management. It sounded boring at first, but the more I thought about it, the more I liked the idea because it's more 'interactive' than the Sites I've built before... and since I was looking for a new project idea anyways, I thought I'd go for it.",
  "aboutMma2": "Realistically, the App won't have many users, so learning to build a complete Backend for it would be too much - instead, I used Google Firebase Auth and Firestore as a Backend, which, in retrospect, were more than enough new technologies to learn at once. For Firebase auth, I stuck to a Tutorial by Rwieruch which was super helpful and teached me lots of things. While this project took me significantly longer than anticipated (because after Covid Lockdowns I started working full time again), it was SO much fun and although this wasn't my first React project, it finally 'clicked' to the point where I could work my way through the different Documentations to finish this project and had to google a lot less.",
  "mmaFeature1": "User Authentication + Account",
  "mmaFeature2": "Settings (Password reset, change Email)",
  "mmaFeature3": "Customizable 'Quick Activities'",
  "mmaFeature4": "Customizable Profile + Banner Picture",
  "mmaFeature5": "Motivational Random Quote via API",
  "mmaFeature6": "Data Visualization via ApexCharts",
  "mmaFeature7": "Table overview (All Activities) incl. filtering",
  "mmaFeature8": "'Live Activities' (Stopwatch, Counter)",
  "mmaFeature9": "Manually enter activities with Date Picker",
  "krsHeading": "Kaufmanns Recipe Site",
  "krsSubheading": "Over 180 real family recipes.",
  "aboutKrs1": "Our family loves to cook - and since I use cooking websites frequently, and also use my grandfather's recipes frequently, I thought I'd make the best of both worlds and combine the two.",
  "aboutKrs2": "Kaufmanns Recipe Site (or 'Kaufmanns-Rezeptsammlung' in German) is a real Website with my grandfather's collection of ~180 phenomenal recipes collected over the last 50 years - some of which were even made by my great-great-grandmother. The recipes were once used in a Print-On-Demand book that was sold on Amazon KDP and a 237-page PDF version in print-ready quality of said book is available to download for free (make sure to use Dual Page Layout when reading). Since it's a 'real' Website including real-world content, everything is written in German.",
  "krsFeature1": "Over 180 real recipes from my grandfather",
  "krsFeature2": "Including 237 page Ebook made in Photoshop",
  "krsFeature3": "'Real' Website (German Content)",
  "krsFeature4": "11 Recipe Categories",
  "krsFeature5": "Contentful Database API",
  "krsFeature6": "Searchable Recipes",
  "krsFeature7": "Logic set up for X amount of recipes (expandable)",
  "krsFeature8": "Custom CSS and React-Bootstrap",
  "krsFeature9": "Social Media Share funtion"
}
