{
  "homeName": "I'm Marco",
  "homeFrom": "based in Hessen, Deutschland.",
  "homeAbout1": "A passionate nerd who creates user-centric",
  "homeAbout2": "and accessible digital experiences.",
  "homeAbout3": "I also love React. And dogs.",
  "homeButtonText": "Take a look at my work",
  "navProjects": "Projects",
  "navAbout": "About",
  "navContact": "Contact",
  "projectsHeading": "Projects",
  "projectsSubheading": "(newest to oldest)",
  "viewSource": "View Source",
  "viewLiveVersion": "View Live Version",
  "password": "Password",
  "technologiesUsed": "Technologies Used",
  "more": "More",
  "less": "Less",
  "aboutProject": "About",
  "personalPortfolioPage": "Personal Portfolio Page",
  "aboutPersonalPortfolioPage1": "While there are no fancy technical things to implement (like User Authentication, API calls or Database implementation), I made sure to make it as visually appealing as I could - although I am not a design-savvy person at all. After a certain amount of research, I stumbled upon React-Spring, which is amazing albeit rather complicated - so you'll find various animations throughout the page like springs, trails and transitions.",
  "aboutPersonalPortfolioPage2": "Ever since my last project ('Make Me Awesome'), TailwindCSS has kind of grown on me so I used it again. What I like about Tailwind is that it doesn't come with pre-opinionated components like Bootstrap so there's more room for creative freedom.",
  "aboutPersonalPortfolioPage3": "The entire page is open-sourced on Github and free for everyone to use. If there are any suggestions, just open a Pull Request or contact me via my Contact Form.",
  "personalPortfolioFeature1": "React Hooks",
  "personalPortfolioFeature2": "Smooth Animations with React-Spring",
  "personalPortfolioFeature3": "Serverless Contact Form via Formspree",
  "personalPortfolioFeature4": "tsParticles Hero Component",
  "personalPortfolioFeature5": "Multilanguage Support",
  "personalPortfolioFeature6": "Dark Mode Support",
  "personalPortfolioFeature7": "Reader Component with realistic page flipping",
  "mmaSubheading": "A personal activity and productivity tracker.",
  "aboutMma1": "A while ago, a friend of mine asked me if I could build a 'personal improvement' Webapp for him where he could track his activities and see where he spends his time on (productive tasks vs. unproductive tasks) so he could improve himself and his time management. It sounded boring at first, but the more I thought about it, the more I liked the idea because it's more 'interactive' than the Sites I've built before... and since I was looking for a new project idea anyways, I thought I'd go for it.",
  "aboutMma2": "Realistically, the App won't have many users, so learning to build a complete Backend for it would be too much - instead, I used Google Firebase Auth and Firestore as a Backend, which, in retrospect, were more than enough new technologies to learn at once. For Firebase auth, I stuck to a Tutorial by Rwieruch which was super helpful and teached me lots of things. While this project took me significantly longer than anticipated (because after Covid Lockdowns I started working full time again), it was SO much fun and although this wasn't my first React project, it finally 'clicked' to the point where I could work my way through the different Documentations to finish this project and had to google a lot less.",
  "mmaFeature1": "User Authentication + Account",
  "mmaFeature2": "Settings (Password reset, change Email)",
  "mmaFeature3": "Customizable 'Quick Activities'",
  "mmaFeature4": "Customizable Profile + Banner Picture",
  "mmaFeature5": "Motivational Random Quote via API",
  "mmaFeature6": "Data Visualization via ApexCharts",
  "mmaFeature7": "Table overview (All Activities) incl. filtering",
  "mmaFeature8": "'Live Activities' (Stopwatch, Counter)",
  "mmaFeature9": "Manually enter activities with Date Picker",
  "krsHeading": "Kaufmanns Recipe Site",
  "krsSubheading": "Over 180 real family recipes.",
  "aboutKrs1": "Our family loves to cook - and since I use cooking websites frequently, and also use my grandfather's recipes frequently, I thought I'd make the best of both worlds and combine the two.",
  "aboutKrs2": "Kaufmanns Recipe Site (or 'Kaufmanns-Rezeptsammlung' in German) is a real Website with my grandfather's collection of ~180 phenomenal recipes collected over the last 50 years - some of which were even made by my great-great-grandmother. The recipes were once used in a Print-On-Demand book that was sold on Amazon KDP and a 237-page PDF version in print-ready quality of said book is available to download for free (make sure to use Dual Page Layout when reading). Since it's a 'real' Website including real-world content, everything is written in German.",
  "krsFeature1": "Over 180 real recipes from my grandfather",
  "krsFeature2": "Including 237 page Ebook made in Photoshop",
  "krsFeature3": "'Real' Website (German Content)",
  "krsFeature4": "11 Recipe Categories",
  "krsFeature5": "Contentful Database API",
  "krsFeature6": "Searchable Recipes",
  "krsFeature7": "Logic set up for X amount of recipes (expandable)",
  "krsFeature8": "Custom CSS and React-Bootstrap",
  "krsFeature9": "Social Media Share funtion",
  "ltSubheading": "A Mockup Travel Agency Site in React.",
  "aboutLt1": "My second attempt of using React. A mockup Travel agency Website that displays backend data from Contentful and lets the user filter through it. For each section (Double Economy, Beachfront Luxurious etc.) there is a Hero-component.",
  "aboutLt2": "The pictures are copyright-free pictures from Unsplash and may or may not be accurate representations of their categories and/or be related.",
  "aboutLt3": "The whole Project has been inspired by 'Coding Addicts' Youtube video, though I only got inspired by the Layout - everything else is built from scratch. In the end, I wanted to learn something and not just copy his code (which is most likely significantly more elegant than mine).",
  "aboutLt4": "Note: I did not 'beautify' the Code after months of gaining more knowledge (after all, I want to document my improvements), so the code quality is not up-to-date.",
  "ltFeature1": "Searchable Rooms (filtering)",
  "ltFeature2": "One 'Single Room' Component that accepts props (expandable)",
  "ltFeature3": "Realistic Looking Design",
  "gcSubheading": "A very simple Giphy Clone using their API.",
  "aboutGc1": "My first React Project that I built for training purposes.",
  "aboutGc2": "By default 'Trending' GIF's are pulled from the Giphy API and get displayed in a Flexbox grid. There's a search bar on top where users can input they Keyword and the content on the page gets re-rendered accordingly. It's a simple Site but it works perfectly.",
  "aboutGc3": "Note: I did not 'beautify' the Code after months of gaining more knowledge (after all, I want to document my improvements), so the code quality is not up-to-date.",
  "gcFeature1": "Searchable Giphy API",
  "gcFeature2": "Fully Responsive using Flexbox",
  "gcFeature3": "Modern Design",
  "spSubheading": "A customizable Startpage using Privacy-Friendly alternatives.",
  "aboutSp1": "Since I don't like the privacy-invading nature of Google and other big tech companies alike, I liked the idea of making a privacy Startpage which provides access to great open source alternatives without the need to look for them. Just add them to the Startpage and that's it.",
  "aboutSp2": "Available 'Widgets':",
  "spListItem1": "DuckDuckGo Search Bar",
  "spListItem2": "Openstreetmap (Openroute) Directions",
  "spListItem3": "WeatherWidget.io",
  "spListItem4": "Euronews WorldNews Widget",
  "spListItem5": "Invidious Search Bar",
  "spListItem6": "DeepL Translate Link",
  "aboutSp3": "Using Gridstack.js, every item (Search Bar, News Widget etc.) can be dragged, dropped and resized according to preference. The Grid can be locked and the Layout is stored in LocalStorage.",
  "aboutSp4": "The Site is not mobile-friendly on purpose as I saw no need for something like a Start Page on mobile.",
  "aboutSp5": "Even in hindsight, this project was a cool idea and a lot of fun. Still, after adding countless event listeners and onclick functions, I quickly saw the need for something like React.",
  "aboutSp6": "Note: I did not 'beautify' the Code after months of gaining more knowledge (after all, I want to document my improvements), so the code quality is not up-to-date.",
  "spFeature1": "Privacy-friendly 'Widgets'",
  "spFeature2": "Fully customizable",
  "spFeature3": "Layout stored in LocalStorage",
  "spFeature4": "DuckDuckGo instead of Google Search",
  "spFeature5": "OpenStreetMap instead of Google Maps",
  "spFeature6": "Invidous Frontend instead of Youtube",
  "jppHeading": "Joey's Pizza Place",
  "jppSubheading": "A mockup Single Page Website of a Restaurant",
  "aboutJpp1": "This was my first real project after leaving 'Tutorial Hell'.",
  "aboutJpp2": "A very simple Single Page Website using only HTML5 and CSS3 (and some Bootstrap for the Slideshow) that resembles a fictional Pizza and Pasta Restaurant called 'Joey's'.",
  "aboutJpp3": "Note: I did not 'beautify' the Code after months of gaining more knowledge (after all, I want to document my improvements), so the code quality is not up-to-date.",
  "jppFeature1": "Responsive",
  "jppFeature2": "Image Slideshow",
  "jppFeature3": "Attention to detail in funny descriptions",
  "contactMe": "Contact Me",
  "message": "Message",
  "nameRequired": "the name is required",
  "emailRequired": "the email is required",
  "messageRequired": "the message is required",
  "captchaRequired": "the recaptcha needs to be completed",
  "fieldRequired": "this field is required",
  "send": "Send",
  "goToPage": "Go to page",
  "of": "of",
  "successModalText": "Message sent! I'll be in touch shortly.",
  "whoIamHeading": "Who I am",
  "whoIamText1": "I always loved to create things. Be it making music, photography, writing, game design - but somehow I have always envied people who could write code. After I started learing HTML and CSS, JavaScript and React quickly became a passion.",
  "whoIamText2": "Having been in sales all of my life, I am always trying to not only create software, but to create a user-friendly and focused digital experience that also solves problems and improves users' lives.",
  "passions": "Passions",
  "codingHeading": "Coding",
  "codingText1": "What I love about coding is that it's constantly evolving.",
  "codingText2": "I'm the type of person who gets bored quickly when I feel that I have (semi-)mastered a field - but with coding there's always something new to learn. There's always a new technology, a new Framework, a new Library - and that's why I pick at least one new technology with every new project I start.",
  "writingHeading": "Writing",
  "dogsHeading": "Dogs",
  "dogsText1": "Ever since I was a child, I always wanted a dog. Since my parents were not fond of this idea, I volunteered at a regional animal shelter when I was an adult, which convinced me to get my own four-legged friend.",
  "dogsText2": "When I met my dog,",
  "dogsText3": ", there it was immediately clear that we belong together.",
  "dogsText4": "Through dogs I learned a lot about myself and after the experiences in the animal shelter and privately I even packed my collected knowledge in book form and started writing books.",
  "dogsText5": "To put it in the words of an unknown quote from the Internet:",
  "dogsText6": "Without a dog my house would be clean, my wallet would be full, but my heart would be empty.",
  "readNow": "Read Now",
  "imprintPrivacyPolicy": "Imprint / Privacy Policy",
  "acceptPrivacy": "I accept the",
  "privacyPolicy": "Privacy Policy"
}
